app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Social Studies"], ["room_number", 0], ["created_at", "2020-07-12 20:22:27.035949"], ["updated_at", "2020-07-12 20:22:27.035949"]]
---
    def create
       @school_class = SchoolClass.new(post_params(:title, :room_number))
       @school_class.save

UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 555], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find_by_id(params[:id])
        @school_class.update(post_params(:title, :room_number))