app/controllers/students_controller.rb

    def update
        @student = Student.update(params.require(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Bananas"], ["updated_at", "2020-07-12 20:31:20.791024"], ["id", 1]]